Reports/НалогНаДобавленнуюСтоимостьНерезиденты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Report>
		<Properties>
			<Name>НалогНаДобавленнуюСтоимостьНерезиденты</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВыводитьВОтдельномОкне</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Консолидированный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

AccumulationRegisters/УчетЗачетаНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccumulationRegister>
		<Properties>
			<Name>УчетЗачетаНДС</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДСПоУслугам</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДСПоИмпорту</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СчетДт</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетКт</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриходныйДокумент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗачетНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЗачетНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПорядокУплатыНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядокУплатыНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ЗачетНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ЗачетНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НДСВСтоимость</Name>
					<Comment>НДС включаемая в стоимость ТМЦ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДСВЗачет</Name>
					<Comment>НДС принимаемый в зачет всей суммой</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДСПо_ОС_НМА_НС</Name>
					<Comment>НДС принимаемый в зачет долями в течении 12 мес (ОС или НМА)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДСВЗачетИмущество</Name>
					<Comment>НДС принимаемый в зачет долями в течении 36 мес (недвижимое имущество)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДСВСтоимостьИмущество</Name>
					<Comment>НДС включаемая в стоимость недвижимого имущества</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДСУслугамВСтоимость_ОС_НМА_НС</Name>
					<Comment>НДС по услугам включаемых в стоимость объекта строительства</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДСПоБезвозмездноПолученным</Name>
					<Comment>НДС по безвозмездно полученным ТМЦ, услугам</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДСНеоблагаемый</Name>
					<Comment>НДС не подлежащий вычету по ст.147 НК</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДСПоРазвлечениям</Name>
					<Comment>НДС по развлечениям (не используется)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>СтавкиНДС</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БезНДС</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20</Name>
					<Comment>(Общ) Ставка НДС 20%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС4</Name>
					<Comment>(Общ) Ставка НДС 4%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20_120</Name>
					<Comment>(Общ) Расчетная ставка НДС 20% / 120%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС6</Name>
					<Comment>(Общ) Ставка НДС 6%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС7</Name>
					<Comment>(Общ) Ставка НДС 7%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС8</Name>
					<Comment>(Общ) Ставка НДС 8%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10</Name>
					<Comment>(Общ) Ставка НДС 10%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС15</Name>
					<Comment>(Общ) Ставка НДС 15%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС0</Name>
					<Comment>(Общ) Ставка НДС 0%</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/НалогНаДобавленнуюСтоимостьНерезиденты/Ext/ObjectModule.bsl
Функция СоздатьТаблицуСчетФактур(Счет=Неопределено) Экспорт
	
	Запрос=новый Запрос;
	
	ОтборПоСчету="";
	
	Если Счет=Неопределено Тогда
	Иначе
		Если не Счет.Пустая() Тогда
			ОтборПоСчету=ОтборПоСчету+" И СчетКт = &Счет ";
			Запрос.УстановитьПараметр("Счет",Счет); 
		КонецЕсли; 
	КонецЕсли; 
	
	Запрос.Текст=
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА УчетЗачетаНДСОбороты.ПериодМесяц = &ТекущийПериод
	|			ТОГДА УчетЗачетаНДСОбороты.Поставщик
	|		ИНАЧЕ УчетЗачетаНДСОбороты.ПериодМесяц
	|	КОНЕЦ КАК Поставщик,
	|	ВЫБОР
	|		КОГДА УчетЗачетаНДСОбороты.ПериодМесяц = &ТекущийПериод
	|			ТОГДА УчетЗачетаНДСОбороты.Поставщик.ИНН
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ИНН,
	|	ВЫБОР
	|		КОГДА УчетЗачетаНДСОбороты.ПериодМесяц = &ТекущийПериод
	|			ТОГДА УчетЗачетаНДСОбороты.Договор
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК Договор,
	|	ВЫБОР
	|		КОГДА УчетЗачетаНДСОбороты.ПериодМесяц = &ТекущийПериод
	|			ТОГДА УчетЗачетаНДСОбороты.ПриходныйДокумент
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ПриходныйДокумент,
	|	СУММА(УчетЗачетаНДСОбороты.СуммаОборот) КАК Сумма,
	|	СУММА(УчетЗачетаНДСОбороты.СуммаНДСОборот + УчетЗачетаНДСОбороты.СуммаНДСПоУслугамОборот + УчетЗачетаНДСОбороты.СуммаНДСПоИмпортуОборот) КАК НДС,
	|	СУММА(ВЫБОР
	|			КОГДА УчетЗачетаНДСОбороты.ЗачетНДС = &НДСВЗачет
	|				ТОГДА ВЫБОР
	|						КОГДА УчетЗачетаНДСОбороты.СуммаНДСОборот + УчетЗачетаНДСОбороты.СуммаНДСПоУслугамОборот + УчетЗачетаНДСОбороты.СуммаНДСПоИмпортуОборот <> 0
	|							ТОГДА УчетЗачетаНДСОбороты.СуммаОборот
	|						ИНАЧЕ 0
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаВЗачет,
	|	СУММА(ВЫБОР
	|			КОГДА УчетЗачетаНДСОбороты.ЗачетНДС = &НДСВЗачет
	|				ТОГДА УчетЗачетаНДСОбороты.СуммаНДСОборот + УчетЗачетаНДСОбороты.СуммаНДСПоУслугамОборот + УчетЗачетаНДСОбороты.СуммаНДСПоИмпортуОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НДСВЗачет,
	|	СУММА(ВЫБОР
	|			КОГДА УчетЗачетаНДСОбороты.ЗачетНДС = &НДСПо_ОС_НМА_НС
	|				ТОГДА ВЫБОР
	|						КОГДА УчетЗачетаНДСОбороты.СуммаНДСОборот + УчетЗачетаНДСОбороты.СуммаНДСПоУслугамОборот + УчетЗачетаНДСОбороты.СуммаНДСПоИмпортуОборот <> 0
	|							ТОГДА УчетЗачетаНДСОбороты.СуммаОборот
	|						ИНАЧЕ 0
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаОС,
	|	СУММА(ВЫБОР
	|			КОГДА УчетЗачетаНДСОбороты.ЗачетНДС = &НДСПо_ОС_НМА_НС
	|				ТОГДА УчетЗачетаНДСОбороты.СуммаНДСОборот + УчетЗачетаНДСОбороты.СуммаНДСПоУслугамОборот + УчетЗачетаНДСОбороты.СуммаНДСПоИмпортуОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НДСОС,
	|	СУММА(ВЫБОР
	|			КОГДА УчетЗачетаНДСОбороты.ЗачетНДС = &НДСУслугамВСтоимость_ОС_НМА_НС
	|				ТОГДА ВЫБОР
	|						КОГДА УчетЗачетаНДСОбороты.СуммаНДСОборот + УчетЗачетаНДСОбороты.СуммаНДСПоУслугамОборот + УчетЗачетаНДСОбороты.СуммаНДСПоИмпортуОборот <> 0
	|							ТОГДА УчетЗачетаНДСОбороты.СуммаОборот
	|						ИНАЧЕ 0
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаУслуги,
	|	СУММА(ВЫБОР
	|			КОГДА УчетЗачетаНДСОбороты.ЗачетНДС = &НДСУслугамВСтоимость_ОС_НМА_НС
	|				ТОГДА УчетЗачетаНДСОбороты.СуммаНДСОборот + УчетЗачетаНДСОбороты.СуммаНДСПоУслугамОборот + УчетЗачетаНДСОбороты.СуммаНДСПоИмпортуОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НДСУслуги,
	|	СУММА(ВЫБОР
	|			КОГДА УчетЗачетаНДСОбороты.ЗачетНДС = &НДСПоРазвлечениям
	|				ТОГДА ВЫБОР
	|						КОГДА УчетЗачетаНДСОбороты.СуммаНДСОборот + УчетЗачетаНДСОбороты.СуммаНДСПоУслугамОборот + УчетЗачетаНДСОбороты.СуммаНДСПоИмпортуОборот <> 0
	|							ТОГДА УчетЗачетаНДСОбороты.СуммаОборот
	|						ИНАЧЕ 0
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК суммаДосуг,
	|	СУММА(ВЫБОР
	|			КОГДА УчетЗачетаНДСОбороты.ЗачетНДС = &НДСПоРазвлечениям
	|				ТОГДА УчетЗачетаНДСОбороты.СуммаНДСОборот + УчетЗачетаНДСОбороты.СуммаНДСПоУслугамОборот + УчетЗачетаНДСОбороты.СуммаНДСПоИмпортуОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НДСДосуг,
	|	СУММА(ВЫБОР
	|			КОГДА УчетЗачетаНДСОбороты.ЗачетНДС = &НДСПоБезвозмездноПолученным
	|				ТОГДА ВЫБОР
	|						КОГДА УчетЗачетаНДСОбороты.СуммаНДСОборот + УчетЗачетаНДСОбороты.СуммаНДСПоУслугамОборот + УчетЗачетаНДСОбороты.СуммаНДСПоИмпортуОборот <> 0
	|							ТОГДА УчетЗачетаНДСОбороты.СуммаОборот
	|						ИНАЧЕ 0
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаБезвозмездно,
	|	СУММА(ВЫБОР
	|			КОГДА УчетЗачетаНДСОбороты.ЗачетНДС = &НДСПоБезвозмездноПолученным
	|				ТОГДА УчетЗачетаНДСОбороты.СуммаНДСОборот + УчетЗачетаНДСОбороты.СуммаНДСПоУслугамОборот + УчетЗачетаНДСОбороты.СуммаНДСПоИмпортуОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НДСБезвозмездно,
	|	ВЫБОР
	|		КОГДА УчетЗачетаНДСОбороты.ПериодМесяц = &ТекущийПериод
	|			ТОГДА УчетЗачетаНДСОбороты.Регистратор
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК Регистратор,
	|	ВЫБОР
	|		КОГДА УчетЗачетаНДСОбороты.ПериодМесяц = &ТекущийПериод
	|			ТОГДА 2
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК ДляСортировки
	|ИЗ
	|	РегистрНакопления.УчетЗачетаНДС.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Авто,
	|			Организация = &Организация
	|				И Поставщик.Инопартнер
	|				И (НЕ Поставщик.НеУчитыватьПриРасчетеНДС)
	|				И ВЫБОР КОГДА Договор = Значение(Справочник.ДоговорыКонтрагентов.ПустаяСсылка) ТОГДА ИСТИНА ИНАЧЕ (НЕ Договор.НеУчитыватьПриРасчетеНДС) КОНЕЦ "+ОтборПоСчету+" ) КАК УчетЗачетаНДСОбороты
	|ГДЕ
	|	(НЕ УчетЗачетаНДСОбороты.СуммаНДСОборот + УчетЗачетаНДСОбороты.СуммаНДСПоУслугамОборот + УчетЗачетаНДСОбороты.СуммаНДСПоИмпортуОборот = 0)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА УчетЗачетаНДСОбороты.ПериодМесяц = &ТекущийПериод
	|			ТОГДА УчетЗачетаНДСОбороты.Поставщик
	|		ИНАЧЕ УчетЗачетаНДСОбороты.ПериодМесяц
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА УчетЗачетаНДСОбороты.ПериодМесяц = &ТекущийПериод
	|			ТОГДА УчетЗачетаНДСОбороты.Поставщик.ИНН
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА УчетЗачетаНДСОбороты.ПериодМесяц = &ТекущийПериод
	|			ТОГДА УчетЗачетаНДСОбороты.Договор
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА УчетЗачетаНДСОбороты.ПериодМесяц = &ТекущийПериод
	|			ТОГДА УчетЗачетаНДСОбороты.ПриходныйДокумент
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА УчетЗачетаНДСОбороты.ПериодМесяц = &ТекущийПериод
	|			ТОГДА УчетЗачетаНДСОбороты.Регистратор
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА УчетЗачетаНДСОбороты.ПериодМесяц = &ТекущийПериод
	|			ТОГДА 2
	|		ИНАЧЕ 1
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДляСортировки,
	|	Поставщик";    //  "+ОтборПоСчету+"
	
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("НачалоПериода",НачалоДня(НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода",КонецДня(КонецПериода));
	Запрос.УстановитьПараметр("ТекущийПериод",НачалоМесяца(КонецПериода));
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("НДСВЗачет",Перечисления.ЗачетНДС.НДСВЗачет);
	Запрос.УстановитьПараметр("НДСПо_ОС_НМА_НС",Перечисления.ЗачетНДС.НДСПо_ОС_НМА_НС);
	Запрос.УстановитьПараметр("НДСУслугамВСтоимость_ОС_НМА_НС",Перечисления.ЗачетНДС.НДСУслугамВСтоимость_ОС_НМА_НС);
	Запрос.УстановитьПараметр("НДСПоБезвозмездноПолученным",Перечисления.ЗачетНДС.НДСПоБезвозмездноПолученным);
	Запрос.УстановитьПараметр("НДСПоРазвлечениям",Перечисления.ЗачетНДС.НДСПоРазвлечениям);
	
	тз=Запрос.Выполнить().Выгрузить();
	Возврат тз;

КонецФункции // ()

Функция ПолучитьОборотПоСубсчету(тз,КодСчета,ВидОборота) Экспорт
	
	Оборот=0;
	
	Счет=ПланыСчетов.Хозрасчетный.НайтиПоКоду(КодСчета);
	
	Для каждого строкаТз из Тз цикл
		Если строкаТз.Счет=Счет или строкаТз.Счет.ПринадлежитЭлементу(Счет) тогда
			Если ВидОборота="Д" Тогда
				Оборот=Оборот+строкаТз.СуммаОборотДт;
			ИначеЕсли ВидОборота="К" Тогда
				Оборот=Оборот+строкаТз.СуммаОборотКт;
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;	
	
	Возврат Оборот;
	
КонецФункции

Функция РасчетНДСНерезиденты_Получить(ПолучитьСтроку = Ложь, Стр = "") Экспорт
	Перем Строки;   	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СУММА(УслугиСвязиВходящие.Сумма) КАК Сумма,
	|	СУММА(УслугиСвязиВходящие.СуммаНДС) КАК СуммаНДС,
	|	УслугиСвязиВходящие.СтавкаНДС
	|ИЗ
	|	Документ.УслугиСвязи.Входящие КАК УслугиСвязиВходящие
	|ГДЕ
	|	УслугиСвязиВходящие.Ссылка.Проведен = ИСТИНА
	|	И УслугиСвязиВходящие.Ссылка.Организация = &Организация
	|	И УслугиСвязиВходящие.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|СГРУППИРОВАТЬ ПО
	|	УслугиСвязиВходящие.СтавкаНДС";
	
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(КонецПериода));
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(НачалоПериода));
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Результат = Запрос.Выполнить();
	ОборотыУслугиСвязи = Результат.Выгрузить();
	
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ХозрасчетныйОбороты.СуммаОборотДт,
	|	ХозрасчетныйОбороты.СуммаОборотКт,
	|	ХозрасчетныйОбороты.Счет,
	|	ХозрасчетныйОбороты.КорСчет
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, , Счет = &Счет, , Организация = &Организация, КорСчет = &КорСчет, ) КАК ХозрасчетныйОбороты
	|ГДЕ
	|	ХозрасчетныйОбороты.КорСубконто1.УчитыватьПриРасчетеНалогаНаПрибыль";

	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(КонецПериода));
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(НачалоПериода));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Счет", ПланыСчетов.Хозрасчетный.НайтиПоКоду("5211"));
	Запрос.УстановитьПараметр("КорСчет", ПланыСчетов.Хозрасчетный.НайтиПоКоду("3190"));
	
	Обороты52и31 = Запрос.Выполнить().Выгрузить();
	
	а0102=ПолучитьОборотПоСубсчету(Обороты52и31,"5211","К"); 
	
	
	а020=ОборотыУслугиСвязи.Найти(Перечисления.СтавкиНДС.НДС20, "СтавкаНДС").Сумма; 
	б020=ОборотыУслугиСвязи.Найти(Перечисления.СтавкиНДС.НДС20, "СтавкаНДС").СуммаНДС;	
	тз=СоздатьТаблицуСчетФактур(ПланыСчетов.Хозрасчетный.ПустаяСсылка());   	
	а020 = а020 + тз.Итог("СуммаУслуги");
	б020 = б020 + тз.Итог("НДСУслуги");
	
	а01011=ОборотыУслугиСвязи.Найти(Перечисления.СтавкиНДС.БезНДС, "СтавкаНДС").Сумма; 
	
	а0101=а020+а01011; 
	б0101=б020;     	
	
	а010=а0102+а0101; 
	б010=б0101;     	
	
	Строки = Новый Структура;
	
	Строки.Вставить("а010", а010);
	Строки.Вставить("б010", б010);
	Строки.Вставить("а0101", а0101);
	Строки.Вставить("б0101", б0101);
	Строки.Вставить("а01011", а01011);
	Строки.Вставить("а0102", а0102);	
	Строки.Вставить("а020", а020);
	Строки.Вставить("б020", б020);
	
	// ДЛЯ КОНСОЛИДАЦИИ {
	
	Если Консолидированный Тогда
		НалоговаяОтчетность.ДобавитьЗначенияПараметровОтчетностиДляКонсолидации(Справочники.ПараметрыОтчетностиДляКонсолидации.НалогНаДобавленнуюСтоимость,Строки,НачалоДня(НачалоПериода),КонецДня(НачалоПериода));
	КонецЕсли;
	
	// } ДЛЯ КОНСОЛИДАЦИИ
	
	Если ПолучитьСтроку Тогда
		Возврат Строки[Стр];	
	Иначе
		Возврат Строки;
	КонецЕсли;         	
	
КонецФункции
